test_data/searchCustomerByName.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://demo.fusesource.com/wsdl/CustomerService/">
   <soapenv:Header/>
   <soapenv:Body>
      <cus:searchCustomersByName>
         <name>Donald</name>
      </cus:searchCustomersByName>
   </soapenv:Body>
</soapenv:Envelope>
