test_data/updateCustomer.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://demo.fusesource.com/wsdl/CustomerService/" xmlns:cus1="http://www.fusesource.com/demo/customer">
   <soapenv:Header/>
   <soapenv:Body>
      <cus:updateCustomer>
         <cust>
            <cus1:firstName>Donald</cus1:firstName>
            <cus1:lastName>Mouse</cus1:lastName>
            <cus1:phoneNumber>12345</cus1:phoneNumber>
            <cus1:id>2</cus1:id>
         </cust>
      </cus:updateCustomer>
   </soapenv:Body>
</soapenv:Envelope>
