test_data/getCustomerStatus.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://demo.fusesource.com/wsdl/CustomerService/">
   <soapenv:Header/>
   <soapenv:Body>
      <cus:getCustomerStatus>
         <customerId>2</customerId>
      </cus:getCustomerStatus>
   </soapenv:Body>
</soapenv:Envelope>
